Revit 2024 API
BaseExportOptions.SetExportLayerTable Method
 Sets layer table back to option
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public void SetExportLayerTable(
	ExportLayerTable layerTable
)
Visual Basic
Public Sub SetExportLayerTable ( _
	layerTable As ExportLayerTable _
)
Visual C++
public:
void SetExportLayerTable(
	ExportLayerTable^ layerTable
)
Parameters
layerTable
Type: Autodesk.Revit.DB.ExportLayerTable
 The layer table to be set
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
BaseExportOptions Class
Autodesk.Revit.DB Namespace